/*
    การใช้ลูปแบบ do-while

    - do-while จะตรวจสอบเงื่อนไขที่ท้ายลูป

    do {
        คำสั่งต่างๆ
    } while (เงื่อนไข)

    - do-while จะตรวจสอบเงื่อนไขที่ท้ายลูป จึงต้องทำคำสั่งที่กำหนดในบล็อก
    ของมันอย่างน้อย 1 ครั้ง
    do {
        print("กรุณาใส่รหัสผ่าน >>")
        var code = readln()
    } while (code != "1234")

    print("ขอบคุณค่ะ")

    - ลูปแบบ while จะตรวจสอบเงื่อนไขก่อนเริ่มลูป และ จะลูปขณะที่เงื่อนไขเป็นจริง
    - ลูปแบบ do-while จะตรวจสอบเงื่อนไขที่ท้ายลูป จะทำคำสั่งในบล็อกของมัน
    อย่างน้อย 1 ครั้ง และ จะลูป ขณะที่ เงื่อนไขยังตรงกับที่ระบุ (จริง)

* */

fun main(args: Array<String>) {



}