import kotlin.random.*

/*

    การตรวจสอบชนิดข้อมูลด้วย is และ !is
    - is ตรวจสอบตัวแปรหรืออินสแตนซ์ เป็นชนิดที่ระบุหรือไม่ หากใช้จะคืนค่า true
    - !is จะใช้ในทางตรงกันข้ามคือ หากตัวแปรหรืออินสแตนซ์ ไม่ใช้ชนิดที่ระบุ จะคืนค่า true

    โครงสร้างโปรเจ็กต์แบบ Empty Activity
    - Empty Activity มีส่วนแสดงผลหลักเพียง 1 หน้าจอเท่านั้น
    เกิดจากการทำงาน 2 ไฟล์ร่วมกัน แสดงผลเป็น 1 หน้าจอคือ

    - MainActivity (.kt) เขียนภาษา Kotlin
    - activity_main.xml ส่วนแสดงผลที่ออกแบบ จะถูกแปลงเป็นสคริปต์ภาษา XML
    โดยอัตโนมัติ เก็บอยู่ในไฟล์นี้

    - การสั่งให้ไฟล์ activity_main.xml ทำงาน ต้องกำหนดภายในฟังก์ชัน onCreate()
    ฟังกชัน onCreate() ถูกสั่งให้ทำงานเป็นลำดับแรกโดยอัตโนมัติเสมอ ส่งผลให้
    หน้าจอแรก MainActivity ปรากกฏขึ้นมาให้เห็นและพร้อมใช้งาน

    - ไฟล์ที่ชื่อว่า activity_main.xml ทำหน้าที่สร้างส่วนแสดงผล
    ถูกสั่งให้ทำงานจากคลาส class MainActivity โดยอาศัยฟังก์ชันที่ชื่อว่า
    setContentView()

* */


fun main(args: Array<String>) {



}
