/*
    แอตทริบิวต์พื้นฐานของวิว

    id วิวทุกตัวที่เรานำมาสร้าง UI ต้องกำหนดค่า id ให้กัยมันเสมอ เพื่อใช้อ้างอิงในโค้ด
    Java หรือ Kotlin รวมถึงในไฟล์ xml ก็มีบางกรณีที่ต้องการอ้างถึงค่า id ด้วย
    ถ้านำวิวมาวางบนหน้าจอออกแบบ Android Studio จะสร้างชื่ออ้างอิงให้ในแบบ
    @+id/ชื่ออ้างอิง

    id
    - @ เป็นสัญลักษณ์ Annotation ที่ใช้อ้างอิงข้อมูลใน Resource
    - + เครื่องหมายบวก หมายถึง ถ้ายังไม่มี id ชื่อนี้ในคลาส Resource ก็ให้ Android
    Studio สร้าง id ขึ้นมาใหม่ พร้อมกับเพิ่ม id ลงในคลาส Resource ให้ด้วย

    text
     - ข้อความที่ปรากฏบนวิวนั้นๆ

     textAllCaps
      - กำหนดเป็น true ข้อความบนวิวจะเป็นตัวพิมพ์ใหญ่ทั้งหมด (วิวบางชนิดมีค่าดีฟอลต์
      เป็น true) หรือ กำหนดเป็น false ได้ เช่น android:textAllCaps="false"

     textSize
       - ขนาดฟอนต์ของข้อความ ในแอนดรอยด์นิยมกำหนดขนาดตัวอักษรในหน่วย sp

     textColor
       - สีข้อความของวิว โดยกำหนดชื่อสีเป็นเลข hexadecimal ในแบบ #rgb และต้อเขียน
       เป็นตัวพิมพ์เล็กทั้งหมด เช่น android:textColor="#00ff9e"

      textStyle
       - รูปแบบข้อความ โดยค่าที่กำหนดได้คือ normal, bold, italic หรือ ถ้าจะใช้หลายรูปแบบ
       ร่วมกันให้เชื่อมด้วยเครื่องหมาย | เช่น bold|italic (ต้องเขียนติดกัน)

      backgroud
       - สีพื้นหลังของวิว หลักการกำหนดสีเช่นเดียวกับ textColor

      layout_width
        - ความกว้างของวิว สำหรับขนาดระยะต่างๆ ในระบบแอนดรอยด์นิยมใช้หน่วย dp เช่น
        100dp หรือ กำหนดเป็นค่าคงที่อย่างใดอย่างหนึ่งคือ

         - match_parent หมายถึงให้กระจายเต็มพื้นที่ความกว้างของวิวที่เป็นคอนเท็นเนอร์ของมัน
         (เลย์เอาต์)

         - wrap_content หมายถึง ให้ความกว้างพอดีกับเนื้อหา หรือ ห่อหุ้มเนื้อหาได้พอดีนั่นเอง เช่น
         android:layout_width="wrap_content"

       layout_height
         - ความสูงของวิว ส่วนการกำหนดค่า ก็ใช้หลักการเดียวกับ layout_width

       gravity
        - ใช้กับการจัดตำแหน่งเนื้อหาของวิว ว่าจะให้เลื่อนไปอยู่ด้านใด โดยค่าที่กำหนดได้คือ
         - left, right, top, bottom ให้อยู่ด้านซ้าย ขวา บน และ ล่าง ตามลำดับ
         เช่น android:gravity="top"

         - center, center_horizontal, center_vertical ให้อยู่กึ่งกลางของทั้ง 2 ด้าน
         กึ่งกลางในแนวนอน (ระหว่างซ้ายขวา) และ กึ่งกลางในแนวตั้ง (ระหว่างบนล่าง)
         ตามลำดับ


      - ในแอนดรอยด์นิยมกำหนดขนาด เช่น ความกว้าง หรือความสูง ในหน่วย dp
      (Density-independent Pixels) แต่หากเป็นขนาดของฟอนต์ นิยมกำหนดในหน่วย sp
      (Scale-independent Pixels)

      - แอตทริบิวต์ gravity สามารถกำหนดพร้อมกันได้มากกว่า 1 ค่า โดยให้คั่นด้วยเครื่องหมาย
      | และ ต้องเขียนติดกัน เช่น android:gravity="top|center_horizontal"




* */

fun main(args: Array<String>) {

}