/*
    การใช้ลูปแบบ while

    - ลูปแบบ while เงื่อนไขเป็นตัวกำหนดขอบเขตหรือจุดสิ้นสุดการวนลูป
    while (เงื่อนไข) {
       คำสั่งต่างๆ
    }

    หลักการของลูป while คือ ถ้าเงื่อนไขยังตรงกับที่กำหนด (เป็นจริง) ก็จะวนไปเรื่อยๆ จน
    กว่าเงื่อนไขจะเป็นเท็จจะสิ้นสุดลูป ดังนั้นต้องมีสิ่งที่ทำให้เงื่อนไขเปลี่ยนแปลงจากจริงเป็นเท็จ

    เช่น ถ้าเลขยกกำลังสองแล้วได้ค่าน้อยกว่า 100 ก็ให้วนลูปไปเรื่อยๆ
    var n = 1
    while ((n * n) < 100) {
        n += 1
    }
    print("n = $n")

    เป็นการรับรหัสจากผู้ใช้ ซึ้งหากใส่ผิดก็ให้ใส่ใหม่ ดังนั้น จึงใช้ลูป while ในการรับข้อมูลไปเรื่อยๆ
    จนกว่าจะใส่ค่าที่ถูกต้อง

     var validCode = false
    while (validCode == false) { // ถ้าตัวแปร validCode ยังเป็น false ให้วนลูปต่อไป
        print("กรุณาใส่รหัสผ่าน >>")
        var code = readln()
        if (code == "1234") {
            // ถ้าใส่รหัสถูก validCode เป็น true ออกจากลูป while
            validCode = true
        }
    }

    print("คุณใส่รหัสถูกต้อง")

* */

fun main(args: Array<String>) {



}