/*

  ลักษณะเพิ่มเติมเกี่ยวกับพารามิเตอร์

  - การระบุชื่ออาร์กิวเมนต์
    เมื่อเรียกฟังก์ชัน เราอาจระบุเฉพาะค่าของอาร์กิวเมนต์
    เช่น test(10, 1.5, true) ซึ้งถ้าดูแบบนี้จะเข้าใจได้ยากว่า
    ข้อมูลในแต่ละค่าหมายถึงสิ่งใด

    - เราสามารถเขียนชื่อพารามิเตอร์กำกับไว้ที่ค่าของอาร์กิวเมนต์แต่
    ละตัวหรือเพียงบางตัวได้

    รูปแบบ
     - ชื่อพารามิเตอร์ = ค่าอาร์กิวเมนต์
     - setInfo(name="John", age=30, married=true)
     - Named Argument หรือ การระบุชื่อให้กับอาร์กิวเมนต์นั่นเอง

    - ชื่ออาร์กิวเมนต์ ต้องเป็นคำที่นำมาจากชื่อพารามิเตอร์ของฟังก์ชัน ตัวพิมพ์ตรงกัน
    ทุกตัวอักษร

    - หากระบุชื่อให้กับอาร์กิวเมนต์ ไม่จำเป็นต้องจัดเรียงข้อมูลให้ตรงกับลำดับ
    ของพารามิเตอร์ เพราะ ชื่อเป็นตัวบงชี้ข้อมูลอยู่แล้ว

    ปกติ เราควรระบุชื่อให้กับอาร์กิวเมนต์ทุกตัว แต่หากกำหนดเพียงบางตัว ต้อง
    พิจารณาเพิ่มดังนี้
     - ต้องวางอาร์กิวเมนต์ทุกตัวที่ไม่ระบุชื่อเอาไว้ก่อนตัวที่ระบุชื่อทั้งหมด
     - ต้องจัดเรียงลำดับอาร์กิวเมนต์ที่ไม่ระบุชื่อให้ตรงกับลำดับของพารามิเตอร์

* */

fun showInfo(name: String, age: Int, married: Boolean, salary: Int) {

    val m = if (married) "แต่งงานแล้ว" else "โสด"

    print("ชื่อ: $name, อายุ: $age, สถานภาพ: $m, เงินเดือน: $salary")

}

fun main(args: Array<String>) {

    showInfo(married=true, name="John", salary = 30_000, age = 30)
    // OK กำหนดชื่ออาร์กิวเมนต์ครบทุกตัว จึงสามารถสลับตำแหน่งกันได้

    // showInfo(Married=true, Name="John", Salary=30_000, Age=30)
    // Error เพราะรูปแบบตัวพิมพ์ของชื่ออาร์กิวเมนต์ ไม่ตรงกับของพารามิเตอร์

    // showInfo(married=true, "John", 30_000, age=30)
    // Error อาร์กิวเมนต์ทุกตัวที่ไม่ระบุชื่อ ต้องอยู่ก่อนตัวระบุชื่อ

    showInfo("John", 30, married = true, salary = 30_000)
    // Ok อาร์กิวเมนต์ทุกตัวที่ไม่ระบุชื่อ ต้องจัดเรียงเหมือนพารามิเตอร์
    // และอยู่ก่อนตัวที่ระบุชื่อทั้งหมด ซึ้งตัวที่ระบุชื่อสามารถสลับตำแหน่งกันได้

}