/*
    ฟังก์ชันสำหรับการคำนวณ

    ใน Kotlin มีกลุ่มฟังก์ชันที่ใช้สำหรับการคำนวณทาง
    คณิตศาสตร์ เช่น kotlin.math

    abs(จำนวน)
     - ค่า absolute ของจำนวนที่กำหนด เช่น abs(-10) // 10

    ceil(เลขทศนิยม)
     - จำนวนเต็มที่อยู่ถัดไปหรืออยู่ข้างบน (ceil) จำนวนที่ระบุ
      ceil(0.01) => 1.0
      ceil(-0.01) => 0.0

     floor(เลขทศนิยม)
      - จำนวนเต็มที่อยู่ก่อนหรืออยู่ข้างล่าง (floor) จำนวนที่ระบุ
      floor(2.99) => 2.0
      floor(-2.99) => -3.0

     round(เลขทศนิยม)
      - จำนวนเต็มที่ไกล้เคียงกับที่ระบุ (เศษมากกว่า 0.5 ปัดเป็นจำนวนเต็ม ) เช่น

      round(4.0) => 4
      round(-4.0) => -4

      เลขฐาน.pow(เลขชี้กำลัง)
       - ใช้ในการหาค่าเลขยกกำลัง เช่น
       2.pow(3) => 8 (2 ยกกำลัง 3)

      max(จำนวน1, จำนวน 2)
       -จำนวนที่มากที่สุดจาก 2 จำนวนที่ระบุ

      min(จำนวน1, จำนวน2)
       -จำนวนที่น้อยที่สุดจาก 2 จำนวนที่ระบุ

      truncate(เลขทศนิยม)
      -เปลี่ยนเลขทศนิยมให้เป็น .0 เช่น truncate(10.99) => 10.0

      เนื่องจาก kotlin.math ไม่ใช้องค์ประกอบพื้นฐานต่อการทำงาน
      หากใช้ฟังก์ชันทางคณิตศาตร์ ต้องสั่ง import แพ็คเกจดังกล่าวเสมอ

      import kotlin.math.*

      fun main() {
        val radius = 10
        val circleArare = PI * radius.pow(2)
      }

* */

fun main(args: Array<String>) {



}