/*

    การกำหนด Resource
    - แหล่งข้อมูลที่จะนำมาใช้กับแอป จะถูกแยกไว้เป็นสัดส่วนเฉพาะซึ้งเรียกว่า Resource
    จะถูกจัดเก็บไว้ในโฟลเดอร์ res

    ชนิดของ Resource
    - จะแบ่งรีซอร์สเป็นหลายชนิด โดยจัดเก็บในโฟล์เดอร์ res แล้วแบ่งเป็นโฟล์เดอร์ย่อยๆ
    ซ้อนลงไป เพื่อแยกเก็บตามชนิดของรีซอร์ส

    - drawable
       ใช้ในการจัดเก็บสิ่งที่เป็นกราฟฟิกซึ้งสามารถวาด (Drawable) เพื่อแสดงบนหน้าจอได้ เช่น
       รูปภาพพื้นฐานต่างๆ (png, jpg, gif)

    - layout
      เก็บไฟล์ที่ใช้ในการจัดโครงร่างของแต่ละแอกทิวิตี้ เช่น activity_main.xml

    - menu
      เก็บไฟล์ที่ใช้สำหรับกำหนดรายการเมนู

    - values
      เก็บไฟล์ที่ใช้กำหนดค่าพื้นฐานต่างๆ (Simple Value) เช่น สตริง ตัวเลข สี หรือ ขนาด




* */

fun main(args: Array<String>) {

}