/*
    โอเปอร์เรเตอร์การกำหนดช่วงข้อมูล

    .. Range Operator (2 จุด) สำหรับกำหนดช่วงข้อมูล
    จากน้อยไปมาก โดยนับค่าสุดท้ายด้วย

    until ฟังก์ชันสำหรับกำหนดช่วงข้อมูลจากน้อยไปมาก แต่ไม่นับค่าสุดท้าย

    downTo ฟังก์ชันสำหรับกำหนดช่วงข้อมูลจากมากไปน้อย

   ** การกำหนดช่วงข้อมูลด้วยฟังก์ชัน until
   ฟังก์ชัน until จะวางไว้ระหว่างค่าแรกและค่าสุดท้าย

   ค่าแรก until ค่าสุดท้าย [step]

   ฟังก์ชัน until จะต่างจาก Range Operator (..) ไม่นับค่าสุดท้าย
   ว่าอยู่ใน Range อย่างอื่นเหมือนกันหมด


* */

fun main(args: Array<String>) {

    val a = 1 until 10
    println(a)

    val b = 0 until 100 step 2
    val c = 10 until 20 step 3

}