/*
   การอ่านส่วนของสตริง

   - ส่วนของสตริง คือ สตริงย่อยๆ ส่วนใดส่วนหนึ่งภายในสตริง

   - take(จำนวน)
     - ตัดเอาสตริงตามจำนวนที่นะบุโดยเริ่มจากตัวแรก

   takeLast(จำนวน)
     - ตัดเอาสตริงตามจำนวนที่ระบุโดยเริ่มจากตัวสุดท้าย

    drop(จำนวน)
     - ตัดสตริงตามจำนวนที่ระบุโดยเริ่มจากตัวแรกออกไป แล้วผลลัพธ์ที่ได้คือสตริงที่เหลืออยู่

    dropLast(จำนวน)
     - ตัดสตริงตามจำนวนที่ระบุโดยเริ่มจากตัวสุดท้ายออกไป

    substring(ลำดับเริ่มต้น)
     - ส่วนของสตริงนับตั้งแต่ลำดับที่กำหนด ไปจนสิ้นสุดสตริง

    substring(ลำดับเริ่มต้น, ลำดับสิ้นสุด)
     - ส่วนของสตริงจากลำดับเริ่มต้นจนถึง ก่อน ลำดับที่ระบุ

    substring(ลำดับเริ่มต้น..ลำดับสิ้นสุด)
     - ส่วนของสตริงจากลำดับเริ่มต้นจนถึงลำดับที่ระบุ โดยกำหนดช่วงในแบบ range

    substringAfter(สตริง)
     - ส่วนของสตริง ที่อยู่ถัดจากสตริงที่ระบุ ซึ้งเจอเป็นครั้งแรกไปจนจบสตริง

    substringAfterLast(สตริง)
     - ส่วนของสตริง ที่อยู่ถัดจากสตริงที่ระบุ ซึ้งเจอเป็นครั้งสุดท้ายไปจนจบสตริง

    substringBefore(สตริง)
     - ส่วนของสตริง ที่อยู่ก่อนสตริงที่ระบุ ซึ้งเจอเป็นครั้งแรกไปจนจบสตริง

    substringBeforeLast(สตริง)
     - ส่วนของสตริง ที่อยู่ก่อนสตริงที่ระบุ ซึ้งเจอเป็นครั้งสุดท้ายไปจนจบสตริง

     substring(ลำดับเริ่มต้น, ลำดับสิ้นสุด) จะกำหนดของเขตการอ่านสตริงย่อย
     ไปจนถึง ก่อนลำดับสิ้นสุดที่ระบุ หรือไม่รวมอักขระในลำดับสิ้นสุดที่ระบุด้วย

     แต่หากกำหนดช่วงแบบ range จะนับรวมลำดับสิ้นสุดด้วย

* */

fun main(args: Array<String>) {

    var str = "Kotlin"
    var s = str.take(3) // Kot
    s = str.takeLast(3) // lin

    s = str.drop(3) // lin ตัดสตริง เริ่มจากข้างหน้า
    s = str.dropLast(3) // Kot ตัดสตริง เริ่มจากข้างหลัง

    s = str.substring(3) // lin ตัดสตริงนับจากข้างหน้ามา 3 ตัว
    s = str.substring(0, 3) // Kot

    s = str.substring(1..4) // otli

    str = "No Pain No Gain"
    s = str.substringAfter("No") // Pain No Gain
    s = str.substringAfterLast("No") // Gain

    str = "I Love You, I Need You"
    s = str.substringBefore("You") // I Love
    s = str.substringBeforeLast("You") // I Love You, I Need



}