import kotlin.random.*

/*

    การตรวจสอบชนิดข้อมูลด้วย is และ !is
    - is ตรวจสอบตัวแปรหรืออินสแตนซ์ เป็นชนิดที่ระบุหรือไม่ หากใช้จะคืนค่า true
    - !is จะใช้ในทางตรงกันข้ามคือ หากตัวแปรหรืออินสแตนซ์ ไม่ใช้ชนิดที่ระบุ จะคืนค่า true

    - ถ้า Element มีวงลกมแบบโปร่งใสเกาะอยู่ทั้ง 4 ด้าน หมายความว่า
    ปุ่มนี้ยังไม่มีการกำหนดให้ยึดติดกับ ConstraintLayout ทุกด้าน

    ConstraintLayout มีเพียง 2 อย่างเท่านั้นคือ
     - กำหนดตำแหน่งตามแนวนอน (แกน x)
     - กำหนดตำแหน่งตามแนวตั้ง (แกน y)

     - ถ้าปุ่มกด Button มีวงกลมทึบด้านซ้าย และ ด้านบนอย่างละ 1 ตำแหน่ง
      หมายความว่า มีการกำหนดให้ยึดติดกับ ConstraintLayout ครบตามกติกาแล้ว

* */


fun main(args: Array<String>) {



}
