/*
    การวนลูปแบบ for-in

    ลูป (Loop) ค่าเริ่มต้นจนถึงค่าสุดท้าย กำหนดด้วย Range Operator

    for (ตัวแปร in ค่าแรก..ค่าสุดท้าย) { // สามารถใช้ .. เป็น until หรือ downTo
     คำสั่งต่างๆ
    }

    ค่าของตัวแปรจะเริ่มตั้งแต่ค่าแรก แล้วเพิ่มขึ้นทีละ 1 ในลูปแต่ละรอบ
    ไปจนถึงค่าสุดท้าย
    for (x in 1..10) {
        print(x)
    }

    val min = 1
    val max = 100
    var count = 0

    for (i in min..max) {
        if (i % 3 == 0) {
            count++
        }
    }

    print("จาก $min - $max มีเลขที่ 3 หารลงตัวเท่ากับ $count จำนวน")

    - กรณีที่ต้องการให้วนลูปจากค่าแรกไปจนถึง ก่อนค่าสุดท้าย ให้กำหนดช่วง
    ข้อมูลด้วย until
    for (a in 0 until 100 step 10) {
        print(a)
    }

    - การเรียงลำดับแบบย้อนกลับ กำหนดช่วงข้อมูลด้วย downTo
    for (i in 10 downTo 1) {
        print(i)
    }

* */

fun main(args: Array<String>) {



}