import kotlin.random.*

/*

   การสร้างและใช้งานอินเทอร์เฟซ
   - Interface เป็นการกำหนดลักษณะโครงสร้างที่อาจประกอบด้วย เมธอด
   และ พร็อปเพอร์ตี้โดยไม่ได้ระบุค่า และ วิธีดำเนินการเอาไว้
   เพื่อให้คลาสที่สืบทอดไปเป็นผู้กำหนดค่าและวิธีดำเนินการเอาเอง

   - การสร้างอินเทอร์เฟซ
   interface ชื่ออินเทอร์เฟซ {
     // สมาชิก
   }
   - ไม่ต้องระบุโมดิฟายเออร์ open เป็น open โดยอัตโนมัติ
   - พร็อปเพอร์ตี้ห้ามกำหนดค่าเริ่มต้น
   - เมธอด ไม่กำหนดวิธีการทำงานใดๆ หรือ จะ กำหนดวิธีการทำงาน

   การติดตั้ง Android SDK เพิ่มเติม
   - การติดตั้ง Android SDK เพื่อกำหนดให้แอปที่ผู้สร้างขึ้นมาสามารถไปติดตั้งบนระบบ
   ปฏิบัติการ Android เวอร์ชันใดบ้าง
   - ไม่จำเป็นต้องติดตั้ง Android SDK ทุกเวอร์ชัน เลือกติดตั้งอย่างน้อยที่สุด 2 เวอร์ชันคือ
   เวอร์ชันน้อยที่สุด กับ เวอร์ชันมากที่สุด
   - ปัจจุบัน Android SDK เวอร์ชั่นน้อยที่สุดที่ควรติดตั้งคือ Android SDK เวอร์ชั่น 8.0
   - ถ้าติดตั้ง Android SDK เวอร์ชั่น 8.0 หมายความว่า แอปที่สร้างขึ้นมาสามารถติดตั้ง
   บนนระบบปฏิบัติการ Android ตั้งแต่เวอร์ชั่น 8.0 ขึ้นไป

* */

interface Shape3D {
    val PI: Double // Abstract Property
    fun surfaceArea(): Int // Abstract Method
    fun volume(): Int
    fun shapeName(): String = this.javaClass.name
}


fun main(args: Array<String>) {



}
