import kotlin.random.*

/*

   การสร้างและใช้งานอินเทอร์เฟซ
   - Interface เป็นการกำหนดลักษณะโครงสร้างที่อาจประกอบด้วย เมธอด
   และ พร็อปเพอร์ตี้โดยไม่ได้ระบุค่า และ วิธีดำเนินการเอาไว้
   เพื่อให้คลาสที่สืบทอดไปเป็นผู้กำหนดค่าและวิธีดำเนินการเอาเอง

   - การสร้างอินเทอร์เฟซ
   interface ชื่ออินเทอร์เฟซ {
     // สมาชิก
   }
   - ไม่ต้องระบุโมดิฟายเออร์ open เป็น open โดยอัตโนมัติ
   - พร็อปเพอร์ตี้ห้ามกำหนดค่าเริ่มต้น
   - เมธอด ไม่กำหนดวิธีการทำงานใดๆ หรือ จะ กำหนดวิธีการทำงาน

   สภาพแวดล้อมของ Android Studio
   - แท็บ Project ทำหน้าที่แสดงโครงสร้างรายการไฟล์ทั้งหมดในโปรเจ็ค
   - แถบ widget เก็บรายการ widget ประเภทต่างๆ ใช้สำหรับออกแบบส่วน
   แสดงผลในแต่ละหน้าจอ
   - แถบ Design แสดงผลจำลอง ทำหน้าที่แสดงผลในแต่ละหน้าจอ ตามรายการไฟล์ที่
   เลือกในโฟลเดอร์ /res/layout มี 3 โหมดคือ code, split และ design
   หมายเหตุ
   เมื่อออกแบบด้วย widget ต่างๆ จะได้สคริปต์ xml โดยอัตโนมัติ



* */

interface Shape3D {
    val PI: Double // Abstract Property
    fun surfaceArea(): Int // Abstract Method
    fun volume(): Int
    fun shapeName(): String = this.javaClass.name
}


fun main(args: Array<String>) {



}
