/*
    โอเปอร์เรเตอร์การกำหนดช่วงข้อมูล

    .. Range Operator (2 จุด) สำหรับกำหนดช่วงข้อมูล
    จากน้อยไปมาก โดยนับค่าสุดท้ายด้วย

    until ฟังก์ชันสำหรับกำหนดช่วงข้อมูลจากน้อยไปมาก แต่ไม่นับค่าสุดท้าย

    downTo ฟังก์ชันสำหรับกำหนดช่วงข้อมูลจากมากไปน้อย

   ** ฟังก์ชัน downTo ช่วงข้อมูล จาก มาก ไปหา น้อย
   ค่าแรก downTo ค่าสุดท้าย [step]

   ค่าแรกต้องมากกว่าหรือเท่ากับค่าสุดท้าย และจะนับรวมค่าสุดท้าย
   ให้อยู่ใน Range ด้วย




* */

fun main(args: Array<String>) {

    val a = 10 downTo 1 // -1
    val b = 20
    val c = b downTo 10 step 3 // -3
    println(c)

}