/*

  พารามิเตอร์แบบ default value

  - กำหนดรูปแบบ default value ชื่อพารามิเตอร์: ชนิดข้อมูล = ค่าดีฟอลต์
  - เมื่อเรียกใช้ฟังก์ชัน หากใช้ค่าที่ตรงกับดีฟอลต์ ก็ไม่จำเป็นต้องระบุอาร์กิวเมนต์ลงไป
  - ยกเว้นกรณีที่จะใช้ค่าเป็นอย่างอื่น

  - เราสามารถสลับตำแหน่งอาร์กิวเมนต์แบบ default ได้ สามารถวางไว้ก่อนอาร์กิวเมนต์
  ที่ไม่ใช้ค่าดีฟอลต์ได้

* */

fun total(q: Int, p: Double, vat: Double = 7.0) = q * p * (1 + (vat / 100))

fun main(args: Array<String>) {

    val a = total(10, 100.0) // ใช้ค่าดีฟอลต์คือ vat = 7.0
    val b = total(vat=7.5, q = 5, p = 500.0)
    // หากใช้ค่า vat ที่แตกต่างไปจากดีฟอลต์ ต้องระบุตามปกติ
    // สามารถสลับตำแหน่งได้
    val c = total(p=500.0, q = 5, vat = 7.5)
    // สามารถสลับตำแหน่งได้



}