/*
   การค้นหาตำแหน่ง

   - การตรวจสอบลำดับของสตริงย่อย

   indexOf(ส่วนของสตริง)
    - ค้นหาตำแหน่งของสตริงที่เจอครั้งแรก ไม่พบคืนค่า -1

   indexOf(ส่วนของสตริง,
   ตำแหน่งเริ่มต้นค้นหา)
    - หากระบุตำแหน่งเริ่มต้นด้วย จะเริ่มจากตำแหน่งดังกล่าว
    แต่หากไม่ระบุจะเริ่มจาก 0

   lastIndexOf(ส่วนของสตริง)
    - ค้นหาตำแหน่งของสตริงที่ระบุซึ้งพบครั้งสุดท้าย ไม่พบจะคืนค่า -1

   lastIndexOf(ส่วนของสตริง, [ตำแหน่งเริ่มต้น])
    - ไม่ระบุตำแหน่งเริ่มต้นจะเริ่มจาก 0

* */

fun main(args: Array<String>) {

    val str = "No Pain No Gain"
    var idx = str.indexOf("No") // idx = 0 เป็นตำแหน่งแรกที่เจอ
    idx = str.lastIndexOf("No") // idx = 8
    idx = str.indexOf("PAIN") // idx = -1 ตัวพิมพ์ไม่ตรงกัน

}