/*
    View
    วงกลมกึ่งกลางของแต่ละด้าน ใช้สำหรับสร้าง Constraint
    Android Studio จะกำหนดชนิดของเลย์เอาต์สำหรับจัดโครงร่าง UI ของ
    แอกทิวิตี้เป็นแบบ ConstraintLayout โดยเมื่อเราวางวิวลงไปบนหน้าจอออกแบบ
    วิวดังกล่าวจะยังไม่ได้กำหนดเส้น Constraint จะสังเกตได้จากไอคอนแจ้งเตือนที่
    Component Tree Window ทั้งนี้ หากวิวอันใดที่ยังไม่ถูกกำหนดเส้นดังกล่าว เมื่อรันแอป
    จะแสดงซ้อนทับกันที่ตำแหน่ง (0, 0) หรือ ที่มุมซ้ายของหน้าจอ แก้ปัญหาด้วยการเพิ่ม
    Constraint

* */

fun main(args: Array<String>) {

}