/*
    คอลเล็กชันประเภท List
    สำหรับจัดเก็บรายการข้อมูลที่สามารถเข้าถึงสมาชิกด้วยเลขลำดับคล้ายกับอาร์เรย์
    แต่มีความยืดหยุ่นต่อการเปลี่ยนแปลงจำนวนสมาชิกโดยการเพิ่มหรือลบรายการได้
    ในขณะที่อาร์เรย์นั้น จำนวนสมาชิกจะคงที่ตลอด

    Immutable List
    เป็นลิสต์แบบ Read-Only คืออ่านได้อย่างเดียว แต่ไม่สามารถเปลี่ยนแปลงจำนวนสมาชิก
    โดยการเพิ่มหรือลบได้ กำหนด Type ในแบบ Generic เป็น List<T> และ กำหนดเป็น
    รายการสมาชิกด้วยฟังก์ชัน listOf()


* */

fun main(args: Array<String>) {

    val oddNums: List<Int> = listOf<Int>(1, 3, 5, 7, 9)
    val colors: List<String> = listOf("red", "green", "blue")
    val mobiles = listOf<String>("sumsung", "oppo", "vivo", "sony")
    val vowels = listOf('a', 'e', 'i', 'o', 'u')

    // list ประเภทนี้จะมีเฉพาะเมธอดในการอ่านหรือตรวจสอบข้อมูลเท่านั้น โดยลักษณะ เช่น
    // เดียวกับ Mutable List

}