import kotlin.random.*

/*

    การตรวจสอบชนิดข้อมูลด้วย is และ !is
    - is ตรวจสอบตัวแปรหรืออินสแตนซ์ เป็นชนิดที่ระบุหรือไม่ หากใช้จะคืนค่า true
    - !is จะใช้ในทางตรงกันข้ามคือ หากตัวแปรหรืออินสแตนซ์ ไม่ใช้ชนิดที่ระบุ จะคืนค่า true

    วิธีการ Export โปรเจ็กต์เป็นไฟล์ Zip
    - เป็นวิธีการจัดเก็บโปรเจ็กต์ Android Apps ของเราให้มีขนาดเล็กลง
    ส่งผลให้โปรเจคที่ Export ออกมาอยู่ในสถานะที่ใช้งานไม่ได้ชั่วคราว
    - เวลาเปิดโปรเจ็กต์ (ที่อยู่ในสถานะใช้งานไม่ได้ชั่วคราว) จะต้องมีการ
    ดาวน์โหลดและสร้างไฟล์ชั่วคราวต่างๆ ขึ้นมาใหม่ เพื่อให้โปรเจ็กต์กลับมาอยู่ในสถานะใช้งาน
    ได้ตามปกติ


* */


fun main(args: Array<String>) {



}
