/*

    การอ้างถึงวิวใน Kotlin

    - ใช้คลาสของแอกทิวิตี้ มีเมธอดที่ใช้อ้างถึงวิวที่นำมาวางบนเลย์เอาต์ คือ
    findViewById<T>(R.id.xxx)

    - findViewById() เป็นแบบ Generic ต้องระบุชนิดของวิวเป้าหมายที่ต้องการ
    อ้างถึงด้วย <T> เช่น findViewById<Button>(...)

    - R.id.xxx คือ ชื่อของวิวอันนั้นที่กำหนดให้แก่แอตทริบิวต์ id หรือต่อท้าย @+id
    ในไฟล์เลย์เอาต์ เช่น id="@+id/button_ok" xxx คือ button_ok

    - การเรียกเมธอด findViewById() ต้องทำหลังจากเรียกเมธอด setContentView()
    แล้วเท่านั้น ให้โครงร่างของแอกทิวิตี้ในไฟล์ activity_main.xml ถูกสร้างเป็น ออบเจ็กต์ก่อน


* */

fun main(args: Array<String>) {
    println(18.999999999999999999)
}