/*
    การวางลูปซ้อนกัน

    - การสร้างสามเหลี่ยมตัวเลข โดยใช้ลูป for ซ้อนกัน 2 อัน
    ลูป for ชั้นนอก (i) สำหรับเลื่อนระหว่างแถว
    ลูปชั้นใน (j) ใช้แสดงตัวเลขในแต่ละแถวตั้งแต่ 1 จนถึงลำดับของแถวนั้น

    var str = ""
    for (i in 1..4) { // ลูป i ใช้นับจำนวนแถว (ในแนวตั้ง)
        str = ""
        for (j in 1..i) { // j ใช้ในการแสดงตัวเลขในแต่ละแถวจาก 1 ถึง i
            str += "$j" + " "
        }
        println(str)
    }

    คำสั่ง break
    - break เป็นคำสั่งเพื่อออกจากลูป ซึ้งจะใช้คู่กับลูปแบบ for-in, while, do-while
    โดยระบุคำสั่งนี้ไว้ ญ จุดที่ต้องการออกจากลูป
     - ต้องการออกจากลูป for-in เมื่อตัวนับเท่ากับ 5

     var sum = 0

    for (i in 1..10) {
        if (i == 5) {
            break
        }
        sum += i
    }

    print(sum)

    เกิดจาก 1 + 2 + 3 + 4 = 10 เนื่องจาก i = 5 จะออกจากลูป for

    คำสั่ง continue

    - ใช้กับลูป for, while หรือ do-while เช่นเดียวกับ break ใช้ในทาง
    ตรงกันข้าม ให้วนลูปถัดไปทันทีโดยไม่ทำคำสั่งส่วนที่อยู่ต่อจาก continue

    เช่น เราต้องการหาผลรวมของตัวเลข 1 - 10 แต่ไม่รวมเลข 5

    var sum = 0

    for (i in 1..10) {
        if (i == 5) {
            continue
        }
        sum += i
    }

    print(sum)

    เกิดจาก 1 + 2 + 3 + 4 + 6 + 7 + 8 + 9 + 10 = 50
    โดยไม่นำ 5 มาบวกด้วย เพราะเมื่อ i = 5 จะวนลูปถัดไปทันที



* */

fun main(args: Array<String>) {



}